In [2]:
import pandas as pd

In [9]:
salaries=pd.read_csv(r'data/salaries_data.csv')
testeo=pd.read_csv(r'data/testeo.csv')
muestra=pd.read_csv(r'data/muestra.csv')

In [38]:
salaries.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Data Engineer,140250,USD,140250,US,100,US,M
1,2022,SE,FT,Data Engineer,135000,USD,135000,US,100,US,M
2,2021,MI,FT,BI Data Analyst,100000,USD,100000,US,100,US,M
3,2021,MI,CT,ML Engineer,270000,USD,270000,US,100,US,L
4,2021,MI,FT,Data Engineer,22000,EUR,26005,RO,0,US,L

In [45]:
salaries.work_year.unique()

array([2022, 2021, 2020], dtype=int64)

In [46]:
salaries.experience_level.unique()

array(['SE', 'MI', 'EN', 'EX'], dtype=object)

In [26]:
salaries.job_title.unique()[0]

'Data Engineer'

In [43]:
salaries.job_title.value_counts()

Data Scientist                              121
Data Engineer                               111
Data Analyst                                 81
Machine Learning Engineer                    31
Research Scientist                           12
Data Science Manager                         12
Data Architect                                8
Machine Learning Scientist                    7
Data Analytics Manager                        7
Big Data Engineer                             7
Director of Data Science                      7
ML Engineer                                   6
Lead Data Engineer                            6
Principal Data Scientist                      6
Applied Data Scientist                        5
Data Engineering Manager                      5
Data Science Consultant                       5
AI Scientist                                  5
BI Data Analyst                               5
Head of Data                                  4
Business Data Analyst                         4
Computer Vision Engineer                      4
Analytics Engineer                            3
Lead Data Scientist                           3
Applied Machine Learning Scientist            3
Cloud Data Engineer                           2
Machine Learning Infrastructure Engineer      2
Lead Data Analyst                             2
Data Analytics Engineer                       2
Director of Data Engineering                  2
ETL Developer                                 2
Head of Data Science                          2
Machine Learning Developer                    2
Data Science Engineer                         2
Machine Learning Manager                      1
Staff Data Scientist                          1
Head of Machine Learning                      1
Finance Data Analyst                          1
Financial Data Analyst                        1
Data Analytics Lead                           1
3D Computer Vision Researcher                 1
Principal Data Analyst                        1
Product Data Analyst                          1
Big Data Architect                            1
Data Specialist                               1
Lead Machine Learning Engineer                1
Marketing Data Analyst                        1
Computer Vision Software Engineer             1
Name: job_title, dtype: int64

In [19]:
salaries[salaries.job_title=="Data Scientist"].salary_in_usd.mean()

110782.44628099173

In [27]:
dicti = {}
for i in salaries.job_title.unique():
    mean= salaries[salaries.job_title==f"{i}"].salary_in_usd.mean()
    dicti[i]=mean

In [35]:
sorted_dicti = sorted(dicti.items(), key=lambda kv: kv[1],reverse = True)

In [36]:
import collections

sorted_dict = collections.OrderedDict(sorted_dicti)

In [37]:
sorted_dict

OrderedDict([('Financial Data Analyst', 450000.0),
             ('Data Analytics Lead', 405000.0),
             ('Principal Data Scientist', 214449.5),
             ('Director of Data Science', 195074.0),
             ('Applied Machine Learning Scientist', 178800.0),
             ('Data Architect', 175934.25),
             ('Applied Data Scientist', 175655.0),
             ('Principal Data Analyst', 170000.0),
             ('Head of Data Science', 167000.0),
             ('Data Specialist', 165000.0),
             ('Analytics Engineer', 164900.0),
             ('Data Science Manager', 158328.5),
             ('Director of Data Engineering', 156738.0),
             ('Machine Learning Scientist', 143900.0),
             ('Head of Data', 142703.25),
             ('Lead Data Engineer', 139724.5),
             ('Data Analytics Manager', 127134.28571428571),
             ('Cloud Data Engineer', 124647.0),
             ('Data Engineering Manager', 123227.2),
             ('Machine Learning Engineer', 117583.12903225806),
             ('ML Engineer', 117504.0),
             ('Machine Learning Manager', 117104.0),
             ('Lead Data Scientist', 115190.0),
             ('Data Engineer', 111636.2072072072),
             ('Data Scientist', 110782.44628099173),
             ('Staff Data Scientist', 105000.0),
             ('Research Scientist', 99953.58333333333),
             ('Big Data Architect', 99703.0),
             ('Lead Data Analyst', 94804.5),
             ('Data Analyst', 92154.55555555556),
             ('Business Data Analyst', 91253.5),
             ('Marketing Data Analyst', 88654.0),
             ('Lead Machine Learning Engineer', 87932.0),
             ('Data Science Engineer', 83705.0),
             ('BI Data Analyst', 82454.4),
             ('Head of Machine Learning', 79039.0),
             ('Machine Learning Developer', 78791.0),
             ('Computer Vision Software Engineer', 70000.0),
             ('Data Science Consultant', 67874.2),
             ('Finance Data Analyst', 61896.0),
             ('AI Scientist', 59410.6),
             ('Big Data Engineer', 57080.57142857143),
             ('ETL Developer', 54957.0),
             ('Machine Learning Infrastructure Engineer', 54217.5),
             ('Data Analytics Engineer', 35000.0),
             ('Computer Vision Engineer', 28226.75),
             ('Product Data Analyst', 20000.0),
             ('3D Computer Vision Researcher', 5409.0)])

In [39]:
salaries[salaries.job_title=="3D Computer Vision Researcher"]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
62,2021,MI,PT,3D Computer Vision Researcher,400000,INR,5409,IN,50,IN,M

In [40]:
salaries[salaries.job_title=="Product Data Analyst"]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
282,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S

In [42]:

salaries[salaries.job_title=="Financial Data Analyst"]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
370,2021,MI,FT,Financial Data Analyst,450000,USD,450000,US,100,US,L

In [44]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           500 non-null    int64
 1   experience_level    500 non-null    object
 2   employment_type     500 non-null    object
 3   job_title           500 non-null    object
 4   salary              500 non-null    int64
 5   salary_currency     500 non-null    object
 6   salary_in_usd       500 non-null    int64
 7   employee_residence  500 non-null    object
 8   remote_ratio        500 non-null    int64
 9   company_location    500 non-null    object
 10  company_size        500 non-null    object
dtypes: int64(4), object(7)
memory usage: 43.1+ KB